Ran Plan for dir: `environment/test` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -out "/atlantis-data/repos/shwetaec12/eks-atlantis-demo/6/default/environment/test/default.tfplan"' in '/atlantis-data/repos/shwetaec12/eks-atlantis-demo/6/default/environment/test': exit status 1
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_iam_policy_document.eks_node_group_assume: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-eks-cluster/cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f71346aacb10106d]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
aws_iam_openid_connect_provider.oidc: Refreshing state... [id=arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.eks_node_group_assume: Read complete after 0s [id=2851119427]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_session_context.current: Reading...
aws_iam_role.node_group_role: Refreshing state... [id=eks-node-group-role]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-eks-cluster-cluster-20250608205255912900000001]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06d2c5bdb823d7607]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0187482a5ab4e0656]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02583f947ec11ddbf]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07c46d6e13ca85fa7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0def7ffa6b913c78d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-072ac13db18cc7f7a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04649c48c8480f7bc]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03a1d9a327675dcf1]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06c5664430fc0a4e9]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0822587ed33e5ad5b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cef3ac3aede352ef]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01f20df3c48544aee]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0def7ffa6b913c78d1080289494]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0e7f428dc156bc738]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0acf8969c4a5be3ac]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04b37e5a813bf52ea]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00b19b9571a583b40]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d1a5c2cbc192ce9f]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09478dec567b4744e]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3921118989]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1681001314]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-288785689]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1863296893]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3228412045]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1555398731]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2945052005]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3408453294]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-182202580]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3631538831]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3004828921]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:eu-central-1:895976263444:internet-gateway/igw-04649c48c8480f7bc" -> null
      - id       = "igw-04649c48c8480f7bc" -> null
        tags     = {
            "Environment" = "production"
            "Name"        = "eks-vpc-test"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - id                          = "r-rtb-0def7ffa6b913c78d1080289494" -> null
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-eu-central-1a"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-eu-central-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test"
        }
      + tags_all = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test"
        }
      + vpc_id   = "vpc-0f71346aacb10106d"
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-private"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-private"
        }
      + vpc_id           = "vpc-0f71346aacb10106d"
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public"
        }
      + vpc_id           = "vpc-0f71346aacb10106d"
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-03a1d9a327675dcf1"
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-06c5664430fc0a4e9"
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public-eu-central-1a"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public-eu-central-1a"
        }
      + vpc_id                                         = "vpc-0f71346aacb10106d"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public-eu-central-1b"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "eks-vpc-test-public-eu-central-1b"
        }
      + vpc_id                                         = "vpc-0f71346aacb10106d"
    }

Plan: 11 to add, 0 to change, 0 to destroy.
╷
│ Error: reading IAM OIDC Provider (arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39): operation error IAM: GetOpenIDConnectProvider, https response error StatusCode: 403, RequestID: dfe86122-ebed-4bc8-a39a-3e63495de36c, api error AccessDenied: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: iam:GetOpenIDConnectProvider on resource: arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39 because no identity-based policy allows the iam:GetOpenIDConnectProvider action
│ 
│   with aws_iam_openid_connect_provider.oidc,
│   on main.tf line 28, in resource "aws_iam_openid_connect_provider" "oidc":
│   28: resource "aws_iam_openid_connect_provider" "oidc" {
│ 
╵
╷
│ Error: reading IAM Role (eks-node-group-role): operation error IAM: GetRole, https response error StatusCode: 403, RequestID: b1101edd-6451-4cd3-9846-c9fdfb2dfe18, api error AccessDenied: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: iam:GetRole on resource: role eks-node-group-role because no identity-based policy allows the iam:GetRole action
│ 
│   with aws_iam_role.node_group_role,
│   on main.tf line 70, in resource "aws_iam_role" "node_group_role":
│   70: resource "aws_iam_role" "node_group_role" {
│ 
╵
╷
│ Error: unable to get role (atlantis-irsa-role): operation error IAM: GetRole, https response error StatusCode: 403, RequestID: 52d10379-de1e-4219-aea2-b7d22071aa51, api error AccessDenied: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: iam:GetRole on resource: role atlantis-irsa-role because no identity-based policy allows the iam:GetRole action
│ 
│   with module.eks.data.aws_iam_session_context.current,
│   on .terraform/modules/eks/main.tf line 4, in data "aws_iam_session_context" "current":
│    4: data "aws_iam_session_context" "current" {
│ 
╵
╷
│ Error: reading Security Group (sg-0822587ed33e5ad5b) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: ade8d434-3277-4024-b919-a93bab9fa161, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.cluster["ingress_nodes_443"],
│   on .terraform/modules/eks/main.tf line 197, in resource "aws_security_group_rule" "cluster":
│  197: resource "aws_security_group_rule" "cluster" {
│ 
╵
╷
│ Error: reading IAM Role (my-eks-cluster-cluster-20250608205255912900000001): operation error IAM: GetRole, https response error StatusCode: 403, RequestID: 7e85382d-a2b5-4760-8b55-8133d6bd39e9, api error AccessDenied: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: iam:GetRole on resource: role my-eks-cluster-cluster-20250608205255912900000001 because no identity-based policy allows the iam:GetRole action
│ 
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: e0ab7275-6f11-4734-b388-bab3f6fdfdbf, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: 8b243415-882e-4958-acf6-96cd950abe99, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: 788d9810-436e-438a-ae0a-608e8b6e1d85, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: 4919721e-497c-4645-94cd-35882b93d2aa, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: 405df144-e59c-4431-90df-6566fa6b8d5e, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["egress_all"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: 3eece502-628a-4523-8339-364236d2f1a9, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: bb74cf02-9f35-42f9-9685-496b164b6ed1, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: 2324b622-338e-49e5-8f9d-48709d87e863, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: a9300f7d-7775-4299-876e-3626005635b7, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_cluster_443"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738) Rules: operation error EC2: DescribeSecurityGroupRules, https response error StatusCode: 403, RequestID: f634612a-47e1-488b-82e2-cad47541c482, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeSecurityGroupRules because no identity-based policy allows the ec2:DescribeSecurityGroupRules action
│ 
│   with module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"],
│   on .terraform/modules/eks/node_groups.tf line 207, in resource "aws_security_group_rule" "node":
│  207: resource "aws_security_group_rule" "node" {
│ 
╵
╷
│ Error: reading EC2 NAT Gateway (nat-09478dec567b4744e): operation error EC2: DescribeNatGateways, https response error StatusCode: 403, RequestID: 73a839ce-c6ee-46ac-9bce-6834bd84399d, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749936682611737595 is not authorized to perform: ec2:DescribeNatGateways because no identity-based policy allows the ec2:DescribeNatGateways action
│ 
│   with module.vpc.aws_nat_gateway.this[0],
│   on .terraform/modules/vpc/main.tf line 1078, in resource "aws_nat_gateway" "this":
│ 1078: resource "aws_nat_gateway" "this" {
│ 
╵


```
</details>